initialSetup__ts81.push({
    caption:`only first branch move is masked`,
    initialComment: '?',

    moves: [
        "s-5768J1:５七銀左(68)",
        "C:1",
        "s-5748J1:５七銀右(48)",
        "C:1",
        "s-5758J1:５七銀直(58)",
        "C:1",
        "s-7767J1:７七金寄(67)",
        "C:1",
        "s-7778J1:７七金上(78)",
        "C:1",
        "s-7776=1:７七金引(76)"
    ],
    kifu: `
            # ---- Kifu for Windows V7 V7.44 棋譜ファイル ----
開始日時：2023/03/30 22:14:08
終了日時：2023/03/30 22:18:30
手合割：その他　
上手の持駒：なし
  ９ ８ ７ ６ ５ ４ ３ ２ １
+---------------------------+
| ・ ・ ・ ・ ・ ・ ・ ・ ・|一
| ・ ・ ・ ・ ・ ・ ・ ・ ・|二
| ・ ・ ・ ・ ・ ・ ・ ・ ・|三
| ・ ・ ・ ・ ・ ・ ・ ・ ・|四
| ・ ・ ・ ・ ・ ・ ・ ・ ・|五
| ・ ・ 金 ・ ・ ・ ・ ・ ・|六
| ・ ・v歩 金v歩 ・ ・ ・ ・|七
| ・ ・ 金 銀 銀 銀 ・ ・ ・|八
| ・ ・ ・ ・ ・ ・ ・ ・ ・|九
+---------------------------+
下手の持駒：なし
            `
})