if (typeof(initialSetup__ts81)==='undefined'){initialSetup__ts81=[]}
initialSetup__ts81.push(
    {   caption:'kifu download from piyoshogi',
        sideComment: true,
        kifu:`
        # ----  ぴよ将棋 棋譜ファイル  ----
棋戦：ぴよ将棋
戦型：▲中飛車 ▲木村美濃
開始日時：2023/06/29 10:52:26
終了日時：2023/06/29 11:03:04
手合割：平手
先手：プレイヤー(R541)
後手：Lv19 ひよな(R1030)
手数----指手---------消費時間--
   1 ７六歩(77)   ( 0:03/00:00:03)
*#定跡手
*#推奨定跡: ▲２六歩   ▲７六歩   ▲６八銀
   2 ３四歩(33)   ( 0:01/00:00:01)
*#定跡手
*#推奨定跡: △３四歩   △８四歩   △４二銀   △３二金
   3 ４八銀(39)   ( 0:01/00:00:04)
*#定跡手
*#推奨定跡: ▲２六歩   ▲７五歩   ▲６六歩
   4 ８四歩(83)   ( 0:01/00:00:02)
*#定跡手
*#定跡: △４二飛   △４四歩   △８四歩   △５四歩
   5 ５六歩(57)   ( 0:01/00:00:05)
*#定跡手
*#定跡: ▲４六歩   ▲２二角成   ▲６六歩   ▲７八金   ▲５六歩   ▲６八玉   ▲２六歩
   6 ８五歩(84)   ( 0:01/00:00:03)
*#定跡手
*#定跡: △８五歩
   7 ５七銀(48)   ( 0:01/00:00:06)
*#定跡手
*#定跡: ▲５七銀   ▲７八金
   8 ４四歩(43)   ( 0:01/00:00:04)
*#定跡手
*#定跡: △３二金   △４四歩   △７二銀   △９四歩
   9 ７七角(88)   ( 0:02/00:00:08)
*#定跡手
*#定跡: ▲７七角
  10 ６二銀(71)   ( 0:01/00:00:05)
*#定跡手
*#定跡: △６二銀
  11 ５五歩(56)   ( 0:01/00:00:09)
*#指し手[-2]▲５五歩  △３二銀  ▲２六歩  △７四歩  ▲２五歩  △３三角  ▲６八玉  △４二玉  ▲７八玉  △５二金右  ▲８八銀  △７三銀
*#推奨手[82]▲６八玉  △７四歩  ▲７八玉  △７三銀  ▲２六歩  △６四銀  ▲２五歩  △７五歩  ▲同歩  △同銀  ▲２四歩  △同歩  ▲同飛  △３二金  ▲６六銀  △同銀  ▲同角
*#定跡: ▲７八金
  12 ５二金(61)   ( 0:01/00:00:06)
*#指し手[-32] 好手 △５二金右  ▲２六歩  △７四歩  ▲２五歩  △７三銀  ▲６八玉  △６四銀  ▲７八玉  △３二銀  ▲６六銀  △４二玉  ▲８八玉  △７五歩  ▲同歩  △３三角
  13 ５六銀(57)   ( 0:03/00:00:12)
*#指し手[-78]▲５六銀  △６四歩  ▲５八飛  △４二玉  ▲６八銀  △４三玉  ▲５七銀  △６三銀  ▲７八金  △１四歩  ▲２六歩  △１三角  ▲４六歩  △７四歩
*#推奨手[-26]▲６八玉  △７四歩  ▲７八玉  △７三銀  ▲２六歩  △６四銀  ▲２五歩  △７五歩  ▲２四歩  △同歩  ▲同飛  △３二金  ▲７五歩  △同銀  ▲６六銀  △６四銀  ▲２三歩打  △３三角  ▲２八飛
  14 ３二銀(31)   ( 0:01/00:00:07)
*#指し手[-73]△３二銀  ▲６八銀  △４二玉  ▲５七銀  △７四歩  ▲５八飛  △７三銀  ▲４八玉  △６四銀  ▲６六銀  △３三玉  ▲３八玉  △１四歩  ▲６八角
  15 ５八飛(28)   ( 0:01/00:00:13)
*#▲戦型: 中飛車
*#指し手[-95]▲５八飛  △４二玉  ▲６八銀  △７四歩  ▲５七銀  △７三銀  ▲６六歩  △３一角  ▲７八金  △３三玉  ▲３九金  △６四銀  ▲６五歩  △７三銀  ▲３六歩
*#定跡: ▲６八銀
  16 ４二玉(51)   ( 0:01/00:00:08)
*#指し手[-88]△４二玉  ▲６八銀  △７四歩  ▲４八玉  △７三銀  ▲３八玉  △６四銀  ▲６六歩  △７五歩  ▲６七銀上  △３三角  ▲６五歩  △７六歩  ▲同銀  △７三銀
  17 ４八玉(59)   ( 0:03/00:00:16)
*#指し手[-110]▲４八玉  △１四歩  ▲３八玉  △３三玉  ▲６八銀  △２四歩  ▲５七銀  △２三玉  ▲２八玉  △１三玉  ▲５九金左
*#推奨手[-88]▲６八銀  △７四歩  ▲４八玉  △７三銀  ▲３八玉  △６四銀  ▲６六歩  △７五歩  ▲６七銀上  △３三角  ▲６五歩  △７六歩  ▲同銀  △７三銀
  18 ３三角(22)   ( 0:01/00:00:09)
*#指し手[-58]△３三角  ▲６八銀  △３一玉  ▲５七銀  △２二玉  ▲３八玉  △１二香  ▲２八玉  △１一玉  ▲５九金左  △４三金  ▲４八金左  △７四歩  ▲３八金寄  △２四角  ▲パス  △パス
  19 ３八玉(48)   ( 0:01/00:00:17)
*#指し手[-92]▲３八玉  △３一玉  ▲６八銀  △２二玉  ▲５七銀  △１二香  ▲４六銀  △１一玉  ▲２八玉  △４三金  ▲５九金左  △７四歩  ▲６五銀  △７五歩  ▲同歩  △９四歩
  20 ７四歩(73)   ( 0:01/00:00:10)
*#指し手[-50]△７四歩  ▲６八銀  △３一玉  ▲５七銀  △７三銀  ▲４六銀  △６四銀  ▲２八玉  △７五歩  ▲同歩  △同銀  ▲６八角  △２二玉
  21 １六歩(17)   ( 0:01/00:00:18)
*#指し手[-66]▲１六歩  △３一玉  ▲６五銀  △２二玉  ▲７四銀  △４二角  ▲２八玉  △４三銀  ▲７八銀  △１四歩  ▲５九金左
*#推奨手[-43]▲６五銀  △３一玉  ▲７八銀  △７三銀  ▲５四歩  △同歩  ▲同銀  △６四銀  ▲５三歩打  △６二金  ▲２八玉
  22 ４三銀(32)   ( 0:01/00:00:11)
*#指し手[-53]△４三銀  ▲６八銀  △３一玉  ▲５七銀  △７三銀  ▲２八玉  △６四銀  ▲５九金左  △７五歩  ▲同歩  △同銀  ▲８八角
  23 ２八玉(38)   ( 0:01/00:00:19)
*#指し手[-94]▲２八玉  △７三銀  ▲６八銀  △６四銀  ▲５七銀  △７五歩  ▲同歩  △同銀  ▲６六銀  △同銀  ▲同角  △８六歩  ▲同歩  △同飛  ▲８八飛  △同飛成  ▲同角
*#推奨手[-83]▲６八銀  △３一玉  ▲５七銀  △７三銀  ▲６八金  △６四銀  ▲６六銀  △５一角  ▲５九飛  △８四角  ▲９六歩  △７五歩  ▲同歩  △同銀  ▲パス
  24 １四歩(13)   ( 0:01/00:00:12)
*#指し手[-45]△１四歩  ▲６五銀  △３二玉  ▲７四銀  △６四歩  ▲６八銀  △８四飛  ▲７五歩  △８二飛  ▲５七銀  △２二玉  ▲５六銀
*#推奨手[-153]△７三銀  ▲６八銀  △６四銀  ▲５七銀  △７五歩  ▲同歩  △同銀  ▲６八角  △３二玉  ▲６六銀  △同銀  ▲同歩  △２二玉
  25 ３八金(49)   ( 0:01/00:00:20)
*#指し手[-148]▲３八金  △７三銀  ▲６八銀  △６四銀  ▲５七銀  △７五歩  ▲同歩  △同銀  ▲４六銀  △８六歩  ▲同歩  △３二玉
*#推奨手[-100]▲６五銀  △７三銀  ▲５四歩  △同銀  ▲同銀  △同歩  ▲同飛  △４三金  ▲５八飛  △５三歩打  ▲５九金左  △６四銀
  26 ７三銀(62)   ( 0:01/00:00:13)
*#指し手[-142]△７三銀  ▲６八銀  △６四銀  ▲５七銀  △３二玉  ▲４六銀  △７五歩  ▲同歩  △同銀  ▲６八角  △８六歩  ▲同歩  △８八歩打  ▲５七角  △８九歩成  ▲７五角  △９九と  ▲７四歩打
  27 ６六歩(67)   ( 0:04/00:00:24)
*#指し手[-160]▲６六歩  △３二玉  ▲６八銀  △８四銀  ▲６七銀上  △７五歩  ▲６五銀  △２四角  ▲５四歩  △同歩  ▲同銀  △７六歩  ▲同銀  △５七歩打  ▲４三銀成  △同金  ▲８八飛
  28 ３二金(41)   ( 0:01/00:00:14)
*#指し手[-159]△３二金  ▲５九金  △８四銀  ▲６八角  △２四角  ▲同角  △同歩  ▲８八銀  △３三桂  ▲４八金上  △７三銀  ▲７七銀  △６四銀
  29 ７八銀(79)   ( 0:01/00:00:25)
*#指し手[-182]▲７八銀  △２四角  ▲５九飛  △３三桂  ▲６五銀  △６四歩  ▲５六銀  △３一玉  ▲６七銀上  △２二玉  ▲５八金  △６二銀
*#推奨手[-119]▲６八銀  △３一玉  ▲５九金  △８四銀  ▲４八金上  △２四角  ▲５九飛  △７五歩  ▲６七銀引  △２二玉  ▲６五歩  △７六歩  ▲同銀  △７三銀  ▲６七銀上
  30 ３一玉(42)   ( 0:01/00:00:15)
*#指し手[-122]△３一玉  ▲４六歩  △２二玉  ▲６七銀上  △２四角  ▲４七銀  △６四銀  ▲５九飛  △３三桂  ▲７八金  △４二金右  ▲３六歩  △４一金  ▲５六銀左
*#推奨手[-136]△２四角  ▲５九飛  △３三桂  ▲５八金  △３一玉  ▲６七銀上  △２二玉  ▲４八金左  △８四銀  ▲６五歩  △７五歩  ▲同歩  △同銀  ▲７六歩打  △８四銀
  31 ６七銀(78)   ( 0:01/00:00:26)
*#指し手[-147]▲６七銀上  △４二角  ▲４六歩  △２二玉  ▲４七銀  △６四銀  ▲５九金  △７五歩  ▲同歩  △同銀  ▲７六歩打  △６四銀  ▲５六銀左
  32 ８六歩(85)   ( 0:01/00:00:16)
*#指し手[15]△８六歩  ▲同歩  △２四角  ▲５九飛  △６四歩  ▲５八金  △２二玉  ▲４八金左  △６二銀  ▲６五歩  △同歩  ▲同銀  △６三銀
*#推奨手[-130]△２二玉  ▲４六歩  △４二金右  ▲４七銀  △６四銀  ▲５九金  △７五歩  ▲同歩  △同銀  ▲７六歩打  △６四銀  ▲３六歩  △４一金
  33 ８六歩(87)   ( 0:05/00:00:31)
*#指し手[-18]▲８六歩  △２四角  ▲５九飛  △２二玉  ▲５八金  △６四歩  ▲４八金左  △６二銀  ▲５八銀  △３三桂  ▲５七銀  △７三桂  ▲４六歩  △８一飛  ▲３六歩
  34 ４二角(33)   ( 0:01/00:00:17)
*#指し手[94]△４二角  ▲８八飛  △２二玉  ▲８五歩  △２四角  ▲５八銀  △１二香  ▲６八角  △同角成  ▲同金  △６四銀  ▲７七桂
*#推奨手[-6]△２四角  ▲５九飛  △６二銀  ▲５八金  △２二玉  ▲４八金左  △６四歩  ▲５八銀  △３三桂  ▲５七銀  △７三桂  ▲４六銀  △パス  ▲パス
  35 ８八飛(58)   ( 0:03/00:00:34)
*#指し手[103]▲８八飛  △５一角  ▲８五歩  △２二玉  ▲５八銀  △３三桂  ▲４六歩  △６二角  ▲４七銀上  △８四銀  ▲パス
  36 ２二玉(31)   ( 0:01/00:00:18)
*#指し手[123]△２二玉  ▲８五歩  △２四角  ▲５八銀  △６四歩  ▲９五角  △９四歩  ▲５九角  △３三桂  ▲７七桂  △９五歩  ▲３六歩
  37 ４六歩(47)   ( 0:08/00:00:42)
*#指し手[106] 好手 ▲４六歩  △２四角  ▲４七銀  △４五歩  ▲同歩  △５七角成  ▲５八銀左  △３五馬  ▲３六銀  △４六馬  ▲４七銀上  △５五馬  ▲６五歩  △３三馬  ▲同角成  △同桂  ▲８五歩  △５七角打
  38 ２四角(42)   ( 0:01/00:00:19)
*#指し手[142]△２四角  ▲４七銀  △３三桂  ▲５六銀左  △４二金右  ▲８五歩  △４五歩  ▲同歩  △５七角成  ▲６八金  △２四馬  ▲６七金
*#推奨手[127]△８四銀  ▲４七銀  △７五歩  ▲８五歩  △同銀  ▲７五歩  △８六歩打  ▲５八金  △５一金  ▲６八角  △４一金  ▲３六歩
  39 ４七銀(56)   ( 0:04/00:00:46)
*#▲囲い: 木村美濃
*#指し手[168]▲４七銀  △３三桂  ▲５六銀左  △４五歩  ▲同歩  △５七角成  ▲６八金  △２四馬  ▲８五歩  △４二金右  ▲３六歩  △３五歩  ▲５八金
  40 ３三桂(21)   ( 0:01/00:00:20)
*#指し手[168]△３三桂  ▲５六銀左  △４五歩  ▲同歩  △５七角成  ▲６八金  △２四馬  ▲８五歩  △４二金右  ▲３六歩  △３五歩  ▲５八金
  41 ６五歩(66)   ( 0:02/00:00:48)
*#指し手[7]▲６五歩  △４五歩  ▲同歩  △５七角成  ▲６八金  △８四馬  ▲５六銀左  △９四馬  ▲６七金  △４二金右  ▲６六角  △７二馬
  42 ４五歩(44)   ( 0:01/00:00:21)
*#指し手[60]△４五歩  ▲同歩  △５七角成  ▲６八金  △８四馬  ▲６六角  △９四馬  ▲７七桂  △６四歩  ▲８五桂  △６五歩  ▲７三桂成  △同桂  ▲５七角  △４五桂  ▲４六角
*#推奨手[56]△７五歩  ▲同歩  △４五歩  ▲同歩  △５七角成  ▲７六銀  △６四歩  ▲６八金  △３五馬  ▲３六銀  △４六馬  ▲８五歩  △６五歩  ▲６七金  △６四銀  ▲パス
  43 ４五歩(46)   ( 0:13/00:01:01)
*#指し手[47]▲４五歩  △５七角成  ▲６八金  △８四馬  ▲６六角  △８三馬  ▲７七桂  △６四歩  ▲５六銀左  △６五歩  ▲同銀  △４二金右  ▲６四歩打  △６二銀  ▲８五歩
  44 ５七角成(24) ( 0:01/00:00:22)
*#指し手[60]△５七角成  ▲６八金  △８四馬  ▲６六角  △９四馬  ▲７七桂  △６四歩  ▲８五桂  △６五歩  ▲７三桂成  △同桂  ▲５七角  △４五桂  ▲４六角
  45 ５八銀(67)   ( 0:05/00:01:06)
*#指し手[-184]▲５八銀左  △８四馬  ▲４四歩  △同銀  ▲５四歩  △４三歩打  ▲５三歩成  △同金  ▲４九歩打  △９四馬  ▲８五歩  △同飛  ▲同飛  △同馬  ▲パス
*#推奨手[43]▲５六銀左  △７五歩  ▲４四歩  △同銀  ▲５四歩  △４三歩打  ▲６八金  △２四馬  ▲５三歩成  △同銀  ▲７五歩  △４二金右  ▲８五歩  △パス
  46 ８四馬(57)   ( 0:01/00:00:23)
*#指し手[-143]△８四馬  ▲４四歩  △同銀  ▲５四歩  △４三歩打  ▲５三歩成  △同金  ▲４九歩打  △７五歩  ▲６六角  △７四銀  ▲７八金  △６五銀  ▲７五角  △７四馬  ▲７七桂  △７六銀
  47 ４六銀(47)   ( 0:22/00:01:28)
*#指し手[-284]▲４六銀  △７五歩  ▲４四歩  △同銀  ▲５四歩  △４三歩打  ▲５三歩成  △同金  ▲８五歩  △８三馬  ▲４五歩打  △７六歩  ▲４四歩  △７七歩成  ▲同桂
*#推奨手[-186]▲７八金  △７五歩  ▲６六角  △８三馬  ▲４四歩  △同銀  ▲５四歩  △３五銀  ▲５三歩成  △同金  ▲７五角  △４三金寄
  48 ７五歩(74)   ( 0:01/00:00:24)
*#指し手[55]△７五歩  ▲４四歩  △同銀  ▲５四歩  △４三歩打  ▲８五歩  △８三馬  ▲４五歩打  △７六歩  ▲８六角  △４五桂  ▲同銀  △同銀  ▲５三歩成
*#推奨手[-159]△４二金左  ▲４七銀  △７五歩  ▲８五歩  △７四馬  ▲７五歩  △同馬  ▲４四歩  △３二銀  ▲６八角  △６五馬  ▲７七桂
  49 ７五歩(76)   ( 0:07/00:01:35)
*#指し手[-533]▲７五歩  △同馬  ▲４四歩  △同銀  ▲５四歩  △４三歩打  ▲５三歩成  △同金  ▲４五歩打  △７六歩打  ▲６八角  △４五桂  ▲４七銀  △６五馬
*#推奨手[-297]▲６六角  △７四馬  ▲４四歩  △同銀  ▲５四歩  △４三歩打  ▲４五歩打  △６五馬  ▲６七銀  △３五銀  ▲同銀  △同歩  ▲５三歩成  △同金
  50 ８三馬(84)   ( 0:01/00:00:25)
*#指し手[340] 悪手 △８三馬  ▲４四歩  △同銀  ▲５四歩  △８七歩打  ▲６八飛  △４三金右  ▲４四角  △同金  ▲５三歩成  △５六角打  ▲７七桂  △３八角成  ▲同玉
*#推奨手[-489]△７五馬  ▲４七銀  △６五馬  ▲５八金  △７六歩打  ▲６八角  △６六馬  ▲７七歩打  △６四銀  ▲６七歩打  △６五馬  ▲８五歩
  51 ４四歩(45)   ( 0:06/00:01:41)
*#指し手[367]▲４四歩  △同銀  ▲５四歩  △８七歩打  ▲４四角  △８八歩成  ▲５三歩成  △４一飛打  ▲４三歩打  △同金右  ▲同と  △同金  ▲８八角  △６五馬  ▲４七銀  △８六飛
  52 ４四銀(43)   ( 0:01/00:00:26)
*#指し手[333]△４四銀  ▲５四歩  △３五銀  ▲同銀  △同歩  ▲４一銀打  △４二銀打  ▲６八飛  △５四歩  ▲３二銀  △同玉  ▲パス  △パス
  53 ５四歩(55)   ( 0:01/00:01:42)
*#指し手[238]▲５四歩  △４三歩打  ▲４五歩打  △３五銀  ▲同銀  △同歩  ▲４一銀打  △５四歩  ▲３二銀成  △同玉  ▲３四金打  △２二銀打  ▲４七銀  △６五馬  ▲４四歩  △８七歩打  ▲６八飛  △７五馬
  54 ４三金(32)   ( 0:01/00:00:27)
*#指し手[307]△４三金左  ▲４五歩打  △３五銀  ▲同銀  △同歩  ▲４四歩  △４二金引  ▲５三歩成  △同金直  ▲５四歩打  △同金  ▲４三銀打  △６五馬  ▲４二銀成  △同飛
  55 ４五歩打     ( 0:17/00:01:59)
*#指し手[372]▲４五歩打  △３五銀  ▲同銀  △同歩  ▲４四銀打  △３二銀打  ▲５三歩成  △同金上  ▲同銀成  △同金  ▲４四金打  △同金  ▲同角  △６五馬  ▲７一角成  △８七歩打  ▲６八飛
  56 ８七歩打     ( 0:01/00:00:28)
*#指し手[1194]△８七歩打  ▲４四歩  △４二金引  ▲６八飛  △５四歩  ▲４七銀  △９四馬  ▲５八金  △パス
*#推奨手[885]△７六歩打  ▲４四歩  △７七歩成  ▲４三歩成  △同金  ▲５三歩成  △同金  ▲７七桂  △７六歩打  ▲５四歩打  △同金  ▲４三銀打  △７七歩成
  57 ６八飛(88)   ( 0:14/00:02:13)
*#指し手[610]▲６八飛  △３五銀  ▲同銀  △同歩  ▲４四歩  △５四金  ▲４三銀打  △６一馬  ▲５二銀成  △同馬  ▲４三金打  △５一馬  ▲パス
  58 ３五銀(44)   ( 0:01/00:00:29)
*#指し手[752]△３五銀  ▲同銀  △同歩  ▲４四歩  △４二金引  ▲４三銀打  △５四歩  ▲５二銀成  △同金  ▲５三歩打  △４二金  ▲５二歩成  △同金  ▲３四金打  △７六歩打  ▲４三歩成  △７七歩成  ▲３三と  △３一玉
  59 ３五銀(46)   ( 0:02/00:02:15)
*#指し手[515]▲３五銀  △同歩  ▲４四歩  △４二金引  ▲４三銀打  △５四歩  ▲５二銀成  △同金  ▲４三金打  △７六歩打  ▲６六角  △６五馬  ▲５七角  △５六馬  ▲５二金  △同飛
  60 ３五歩(34)   ( 0:01/00:00:30)
*#指し手[616]△３五歩  ▲４四歩  △４二金引  ▲４三銀打  △５四歩  ▲５二銀成  △同金  ▲４三金打  △７六歩打  ▲６六角  △６五馬  ▲５三歩打  △４二金  ▲５七角  △５六馬  ▲６三飛成
  61 ５三歩成(54) ( 0:03/00:02:18)
*#指し手[532]▲５三歩成  △同金上  ▲４四銀打  △３二銀打  ▲５三銀  △同金  ▲４四金打  △同金  ▲同角  △８八歩成  ▲同飛  △６五馬  ▲７一角成  △５五馬  ▲６八飛  △８六飛
  62 ５三金(52)   ( 0:01/00:00:31)
*#指し手[490]△５三金上  ▲４四銀打  △３二銀打  ▲５三銀  △同金  ▲４四金打  △同金  ▲同角  △８八歩成  ▲同飛  △６五馬  ▲５三角成  △３六歩  ▲４七銀  △４二銀打  ▲７一馬
  63 ４四銀打     ( 0:03/00:02:21)
*#指し手[522]▲４四銀打  △７六歩打  ▲５五角  △４四金直  ▲同歩  △５四銀打  ▲４三金打  △５五銀  ▲５三金  △５六角打  ▲４三歩成  △８九角成  ▲４二金  △７七歩成  ▲３二と  △１三玉
  64 ３二銀打     ( 0:01/00:00:32)
*#指し手[548]△３二銀打  ▲５三銀  △同金  ▲４四金打  △同金  ▲同角  △８八歩成  ▲同飛  △６五馬  ▲７一角成  △７五馬  ▲４七銀  △４五桂  ▲４四馬  △３三銀打
  65 ４七銀(58)   ( 0:15/00:02:36)
*#指し手[402]▲４七銀  △７六歩打  ▲４三銀  △同金  ▲６六角  △３四銀打  ▲４四金打  △同金  ▲同角  △５七金打  ▲６六飛  △８八歩成  ▲５三角成  △９九と
*#推奨手[517]▲５三銀成  △同金  ▲４四金打  △同金  ▲同角  △８八歩成  ▲同飛  △６五馬  ▲３四金打  △４六歩打  ▲７七桂  △７五馬  ▲５四歩打
  66 ７六歩打     ( 0:01/00:00:33)
*#指し手[464]△７六歩打  ▲４三銀  △同金  ▲６六角  △３四銀打  ▲５六銀  △６四歩  ▲４四歩  △６五歩  ▲４三歩成  △６六歩  ▲３二と  △同玉
  67 ６六角(77)   ( 0:35/00:03:11)
*#指し手[244]▲６六角  △４四金直  ▲同歩  △６五馬  ▲５四歩打  △同金  ▲５七角  △５六銀打  ▲同銀  △同馬  ▲３五角  △５三金
*#推奨手[390]▲４三銀  △同金  ▲６六角  △３四銀打  ▲５六銀  △５二飛  ▲４四歩  △５六飛  ▲４三歩成  △同銀引  ▲４四歩打  △３四銀
  68 ４四金(43)   ( 0:01/00:00:34)
*#指し手[246]△４四金直  ▲同角  △同金  ▲同歩  △４二銀打  ▲５四歩打  △５七角打  ▲５三金打  △７七歩成  ▲同桂  △７五角成  ▲６三金  △８六馬  ▲７八金
  69 ４四歩(45)   ( 0:05/00:03:16)
*#指し手[349]▲４四歩  △６五馬  ▲５五金打  △６六馬  ▲同飛  △８八角打  ▲５六飛  △６七銀打  ▲５七飛  △６六角成  ▲５九飛  △９九馬  ▲７一角打  △５二金  ▲８二角成  △同銀
  70 ６五馬(83)   ( 0:01/00:00:35)
*#指し手[255]△６五馬  ▲５五金打  △９二馬  ▲５四歩打  △５二金  ▲６五歩打  △８六飛  ▲７八金  △８二馬  ▲６九飛  △４三歩打  ▲７四歩  △同銀
  71 ４三金打     ( 0:18/00:03:34)
*#指し手[-87]▲４三金打  △同銀  ▲同歩成  △同馬  ▲３三角成  △同馬  ▲４五桂打  △４四馬  ▲３三銀打  △同馬  ▲同桂  △同玉  ▲７一角打  △４四銀打  ▲８二角成  △同銀
*#推奨手[316]▲５五金打  △９二馬  ▲５四歩打  △５二金  ▲６五歩打  △８六飛  ▲９六歩  △３四銀打
  72 ４三銀(32)   ( 0:01/00:00:36)
*#指し手[38]△４三銀  ▲同歩成  △同馬  ▲４四歩打  △６五馬  ▲３四銀打  △３二銀打  ▲４三歩成  △同馬  ▲同銀成  △同金  ▲３三角成  △同金  ▲６三飛成  △８八歩成
  73 ４三歩成(44) ( 0:02/00:03:36)
*#指し手[52]▲４三歩成  △同馬  ▲３三角成  △同馬  ▲４五桂打  △４三馬  ▲３三銀打  △同馬  ▲同桂成  △同玉  ▲７一角打  △４二銀打  ▲５四歩打  △５二金  ▲８二角成  △同銀
  74 ４三馬(65)   ( 0:01/00:00:37)
*#指し手[-23]△４三馬  ▲４四歩打  △２五馬  ▲５四歩打  △同金  ▲２六歩  △６一馬  ▲５八飛  △６五金  ▲５三飛成  △６六金
  75 ５八飛(68)   ( 0:19/00:03:55)
*#指し手[-274]▲５八飛  △４二銀打  ▲７四歩  △同銀  ▲７八金  △８六飛  ▲５四歩打
*#推奨手[11]▲４五歩打  △４六歩打  ▲同銀  △３四金打  ▲４四銀打  △同金寄  ▲同歩  △同金  ▲同角  △同馬
  76 ４九銀打     ( 0:01/00:00:38)
*#指し手[362] 疑問 △４九銀打  ▲３三角成  △同馬  ▲５三飛成  △４三金打  ▲６三龍  △３八銀成  ▲同銀  △８八歩成  ▲パス  △９九と
*#推奨手[-248]△６四銀  ▲３三角成  △同玉  ▲４五桂打  △４二玉  ▲３三銀打  △５一玉  ▲５三桂成  △同銀
  77 ５三飛成(58) ( 0:05/00:04:00)
*#指し手[530] 好手 ▲５三飛成  △３八銀成  ▲同銀  △５三馬  ▲３三角成  △同玉  ▲４五桂打  △２四玉  ▲５三桂成  △４八金打  ▲５一角打  △４二歩打  ▲４九金打  △同金  ▲同銀  △４七角打  ▲３八銀打  △６九角成
  78 ３八銀成(49) ( 0:01/00:00:39)
*#指し手[464]△３八銀成  ▲同銀  △５三馬  ▲３三角成  △同玉  ▲４五桂打  △２四玉  ▲５三桂成  △４八金打  ▲５一角打  △４二歩打  ▲４九金打  △同金  ▲同銀  △４七角打  ▲３八銀打  △６九角成  ▲４三成桂  △８六飛
  79 ３八銀(47)   ( 0:02/00:04:02)
*#指し手[698]▲３八銀  △５三馬  ▲３三角成  △同玉  ▲４五桂打  △２四玉  ▲５三桂成  △４八金打  ▲４九金打  △同金  ▲同銀  △４七角打  ▲５八金  △６五角成  ▲５一角打  △４二歩打
  80 ５三馬(43)   ( 0:01/00:00:40)
*#指し手[655]△５三馬  ▲３三角成  △同玉  ▲４五桂打  △２四玉  ▲５三桂成  △４八金打  ▲４九金打  △同金  ▲同銀  △４七角打  ▲４四角打  △３一飛打  ▲５八金  △同角成
  81 ３四金打     ( 0:16/00:04:18)
*#指し手[727]▲３四金打  △３二金打  ▲３三金  △同金  ▲同角成  △同玉  ▲４五桂打  △４四玉  ▲５三桂成  △同玉  ▲７一角打  △６二金打  ▲５五銀打
  82 ４三金打     ( 0:01/00:00:41)
*#指し手[806]△４三金打  ▲３三角成  △同金  ▲同金  △同玉  ▲４五桂打  △２四玉  ▲５三桂成  △４八金打  ▲４九金打  △同金  ▲同銀  △４七角打  ▲６八金  △８六飛
  83 ３三金(34)   ( 0:18/00:04:36)
*#指し手[580]▲３三金  △同金  ▲同角成  △同玉  ▲４五桂打  △２四玉  ▲５三桂成  △４八金打  ▲４九金打  △８八飛打  ▲４八金  △同飛成  ▲５一角打  △４二歩打  ▲２五銀打  △同玉
  84 ３三金(43)   ( 0:01/00:00:42)
*#指し手[715]△３三金  ▲同角成  △同玉  ▲４五桂打  △２四玉  ▲５三桂成  △４八金打  ▲４九金打  △同金  ▲同銀  △８八飛打  ▲３八銀打  △４八金打  ▲５一角打  △３四玉  ▲４三銀打
  85 ４五桂打     ( 0:01/00:04:37)
*#指し手[551]▲４五桂打  △４三馬  ▲３三桂成  △同馬  ▲４四銀打  △同馬  ▲同角  △３三金打  ▲３一銀打  △同玉  ▲３三角成  △２二銀打  ▲４三馬  △８六飛  ▲３二金打
  86 ４二馬(53)   ( 0:01/00:00:43)
*#指し手[834]△４二馬  ▲３三桂成  △同馬  ▲４四銀打  △５一馬  ▲３三金打  △１二玉  ▲３二銀打  △同飛  ▲同金  △４六桂打  ▲２二飛打  △１三玉
*#推奨手[719]△４二金打  ▲５三桂成  △同金  ▲３四銀打  △４四歩打  ▲３三銀成  △同玉  ▲７一角打  △６七飛打  ▲５三角成  △６六飛成  ▲４三金打  △２四玉
  87 ３四銀打     ( 0:10/00:04:47)
*#指し手[570] 疑問 ▲３四銀打  △４三金打  ▲３三銀  △同金  ▲３一銀打  △同玉  ▲３三桂成  △４八金打  ▲２二金打  △４一玉  ▲４二成桂
*#推奨手[1232]▲５三銀打  △３二金打  ▲４二銀成  △同金  ▲３三桂成  △同金  ▲３一銀打  △同玉  ▲３三角成  △３二金打  ▲１一馬  △４六桂打  ▲５三角打  △４二銀打
  88 ３二金打     ( 0:01/00:00:44)
*#指し手[967]△３二金打  ▲３三桂成  △同金  ▲４三銀打  △４四歩打  ▲４二銀成  △３四金  ▲３一角打  △３三玉  ▲４三金打  △２四玉  ▲４四金  △同金  ▲同角
  89 ３三銀成(34) ( 0:09/00:04:56)
*#指し手[818]▲３三銀成  △同金  ▲３四金打  △４三金打  ▲３三桂成  △同金  ▲３一銀打  △同玉  ▲３三金  △６七飛打  ▲４三歩打  △３三馬  ▲同角成  △６九飛成
*#推奨手[921]▲３三桂成  △同金  ▲４三銀打  △４四歩打  ▲４二銀成  △３四金  ▲３二金打  △１三玉  ▲２二角打  △２四玉  ▲１一角成  △８六飛
  90 ３三馬(42)   ( 0:01/00:00:45)
*#指し手[1034]△３三馬  ▲同桂成  △同金  ▲３四銀打  △３二銀打  ▲４三金打  △４二金打  ▲同金  △同飛  ▲４三歩打  △８二飛  ▲５五角打
  91 ３三桂成(45) ( 0:08/00:05:04)
*#指し手[1091]▲３三桂成  △同金  ▲３四銀打  △３二金打  ▲３三銀成  △同金  ▲４三金打  △４四歩打  ▲３三金  △同玉  ▲７一角打  △４三金打  ▲８二角成  △同銀  ▲３一飛打  △３二銀打
  92 ３三金(32)   ( 0:01/00:00:46)
*#指し手[1154]△３三金  ▲３一銀打  △同玉  ▲３三角成  △２二銀打  ▲５三角打  △２一玉  ▲３二金打  △同飛  ▲同馬  △同玉  ▲５二飛打  △４二歩打  ▲同角成
  93 ３四銀打     ( 0:13/00:05:17)
*#指し手[848]▲３四銀打  △３二銀打  ▲７四歩  △６四銀  ▲３三銀成  △同銀  ▲３四金打  △３二金打  ▲３三金  △同金
  94 ４二金打     ( 0:01/00:00:47)
*#指し手[1869] 疑問 △４二金打  ▲４三歩打  △３二金寄  ▲３三銀成  △同金  ▲４二金打  △３二飛打  ▲同金  △同飛  ▲４一飛打  △３一金打  ▲８一飛成
*#推奨手[1079]△３二金打  ▲３三銀  △同金  ▲４三金打  △４四歩打  ▲３三金  △同玉  ▲７一角打  △４二飛  ▲２五金打  △６七飛打  ▲３四金打  △２二玉
  95 ４三歩打     ( 0:07/00:05:24)
*#指し手[2057]▲４三歩打  △３二金寄  ▲３三銀成  △同金  ▲４二金打  △３一銀打  ▲同金  △５五歩打  ▲４二角打  △４四銀打  ▲２一金打  △１三玉  ▲１一金
  96 ３二金(42)   ( 0:01/00:00:48)
*#指し手[1910]△３二金寄  ▲３三銀成  △同金  ▲４二金打  △３一銀打  ▲同金  △４四桂打  ▲５三角打  △４六飛打  ▲５五銀打  △６六飛  ▲同銀
  97 ４一角打     ( 0:15/00:05:39)
*#指し手[675] 悪手 ▲４一角打  △４六桂打  ▲３二角成  △同飛  ▲３三銀成  △同飛  ▲２一金打  △同玉  ▲３三角成  △３八桂成  ▲同玉  △５六角打  ▲４七金打
*#推奨手[1954]▲３三銀成  △同金  ▲４二金打  △３一銀打  ▲同金  △５五歩打  ▲４二銀打  △４三金  ▲５五角  △４四歩打  ▲３二金打  △１三玉  ▲３三銀成  △同金  ▲同金
  98 ４六桂打     ( 0:01/00:00:49)
*#指し手[3521] 悪手 △４六桂打  ▲３三銀  △同金  ▲３二金打  △１二玉  ▲３三角成  △３八桂成  ▲同玉  △８八飛打  ▲同馬  △同歩成
*#推奨手[997]△４四銀打  ▲３二角成  △同飛  ▲３三銀成  △同銀  ▲４二金打  △４六桂打  ▲３二金  △同玉  ▲５二飛打  △４三玉  ▲５三金打  △３四玉
  99 ４二金打     ( 0:28/00:06:07)
*#指し手[964]▲４二金打  △３八桂成  ▲同玉  △４九銀打  ▲２八玉  △４二飛  ▲３三銀  △同金  ▲４二歩成  △３八金打  ▲１八玉  △２八飛打  ▲１七玉  △２九飛成  ▲３二角成  △１三玉
 100 ３八桂成(46) ( 0:01/00:00:50)
*#指し手[670]△３八桂成  ▲同玉  △４七銀打  ▲同玉  △６七飛打  ▲５七銀打  △４六歩打  ▲５六玉  △６六飛成  ▲同玉  △８八角打  ▲７六玉  △４二金  ▲同歩成  △同飛  ▲６三角成
 101 ３八玉(28)   ( 0:01/00:06:08)
*#指し手[874]▲３八玉  △４九銀打  ▲２八玉  △３八飛打  ▲１七玉  △４四歩打  ▲３三銀  △同玉  ▲３二角成  △２四玉  ▲２八桂打  △３九銀打  ▲１八金打  △２八銀  ▲同金  △２五桂打  ▲１八玉
*#【詰めろ】
 102 ８八飛打     ( 0:01/00:00:51)
*#指し手[2578] 悪手 △８八飛打  ▲６八歩打  △５五歩打  ▲３三銀成  △同玉  ▲３二角成  △４四玉  ▲５六金打  △８九飛成  ▲５五角  △３四玉
*#推奨手[663]△４七銀打  ▲同玉  △６七飛打  ▲５七銀打  △４六歩打  ▲５八玉  △６六飛成  ▲３三銀  △同金  ▲６六銀  △４七角打  ▲６八玉  △２九角成  ▲３四桂打  △同金
 103 ８八角(66)   ( 0:07/00:06:15)
*#指し手[1827] 悪手 ▲８八角  △同歩成  ▲３三銀成  △同金  ▲３二金打  △１三玉  ▲２五桂打  △２四玉  ▲３三桂成  △５六角打  ▲２八玉  △８九と  ▲５四飛打  △３四桂打
*#推奨手[2813]▲６八歩打  △５五歩打  ▲３三銀成  △同玉  ▲３二角成  △４四玉  ▲５六金打  △５四銀打  ▲４六桂打  △８九飛成  ▲５五角  △５三玉
*#【詰めろ】
 104 ８八歩成(87) ( 0:01/00:00:52)
*#指し手[2180]△８八歩成  ▲３三銀成  △同金  ▲３二金打  △１三玉  ▲３三金  △５六角打  ▲２八玉  △３九銀打  ▲同玉  △３八銀打  ▲２八玉  △２九銀成  ▲１七玉  △２五銀打  ▲２一飛打
 105 ３二金(42)   ( 0:07/00:06:22)
*#指し手[590] 悪手 ▲３二金  △同金  ▲５一飛打  △８三角打  ▲５六歩打  △３一金打  ▲４四金打  △９九と  ▲３二角成  △同金
*#推奨手[3102]▲３三銀  △同玉  ▲３二角成  △４四玉  ▲４六金打  △４九銀打  ▲同玉  △６七角打  ▲３八玉  △４九銀打  ▲２八玉
 106 ３二飛(82)   ( 0:01/00:00:53)
*#指し手[1231] 疑問 △３二飛  ▲３三銀  △同飛  ▲５二飛打  △３二銀打  ▲２五桂打  △４八金打  ▲同玉  △４三飛  ▲４七歩打  △６六角打  ▲５七金打
*#推奨手[562]△３二金  ▲４二飛打  △５六角打  ▲４七金打  △同角成  ▲同玉  △４二飛  ▲同歩成  △４四飛打  ▲４五桂打  △４二飛  ▲３二角成  △同飛  ▲４四角打  △１三玉
 107 ３二角成(41) ( 0:03/00:06:25)
*#指し手[1060] 悪手 ▲３二角成  △同金  ▲５二飛打  △６五角打  ▲５六金打  △同角  ▲同飛成  △５五歩打  ▲４四角打  △３三銀打  ▲同銀成  △同金
*#推奨手[2482]▲３三銀  △同飛  ▲３二金打  △１三玉  ▲３三金  △５六角打  ▲２八玉  △３八金打  ▲１七玉  △２五銀打  ▲２一飛打
 108 ３二金(33)   ( 0:01/00:00:54)
*#指し手[609]△３二金  ▲５二飛打  △４九銀打  ▲同玉  △６七角打  ▲３九玉  △４九金打  ▲３八玉  △３四角成  ▲４一銀打  △３一銀打  ▲３二銀成  △同銀  ▲４二歩成
 109 ５二飛打     ( 0:16/00:06:41)
*#指し手[433]▲５二飛打  △４九銀打  ▲同玉  △６七角打  ▲５八金  △３四角成  ▲４二金打  △４八歩打  ▲同玉  △６六角打  ▲３八玉  △４二金  ▲同歩成  △３九金打  ▲２八玉
*#【詰めろ】
 110 ６六角打     ( 0:01/00:00:55)
*#指し手[29992] 悪手 △６六角打  ▲３二飛成  △同玉  ▲４二飛打  △２一玉  ▲３一金打  △同玉  ▲３二金打
*#推奨手[1590]△６五角打  ▲５六歩打  △４九銀打  ▲同玉  △６六角打  ▲４五飛打  △５七銀打  ▲３二飛成  △同玉  ▲４二歩成  △２二玉
 111 ３三金打     ( 0:45/00:07:26)
*#指し手[1834] 悪手 ▲３三金打  △同角  ▲同銀成  △同玉  ▲５一角打  △４二歩打  ▲同歩成  △６五角打  ▲４七歩打  △４九銀打  ▲同玉  △４七角成  ▲５三飛成  △４三歩打  ▲３二と  △同玉
*#推奨手[29993]▲３二飛成  △同玉  ▲４二飛打  △２一玉  ▲３一金打  △同玉  ▲３二金打
 112 ３三角(66)   ( 0:01/00:00:56)
*#指し手[2366]△３三角  ▲３二飛成  △同玉  ▲５二飛打  △４二歩打  ▲同歩成  △２二玉  ▲３二と  △１三玉  ▲３三と  △８三角打  ▲５六歩打  △９九と
 113 ３二飛成(52) ( 0:26/00:07:52)
*#指し手[2535]▲３二飛成  △同玉  ▲５二飛打  △４二歩打  ▲同歩成  △同角  ▲３三金打  △２一玉  ▲４二飛成  △５六角打  ▲４七歩打  △４九銀打  ▲同玉  △６七角成  ▲３八玉
 114 ３二玉(22)   ( 0:01/00:00:57)
*#指し手[2704]△３二玉  ▲５二飛打  △４二歩打  ▲同歩成  △同角  ▲３三金打  △２一玉  ▲４二飛成  △６五角打  ▲４七歩打  △３一銀打  ▲２三銀成  △９九と
 115 ５二飛打     ( 0:20/00:08:12)
*#指し手[2445]▲５二飛打  △４二歩打  ▲同歩成  △同角  ▲３三金打  △２一玉  ▲４二飛成  △６五角打  ▲４七歩打  △３一銀打  ▲２三銀成  △１二金打  ▲同成銀  △同香
 116 ４一玉(32)   ( 0:01/00:00:58)
*#指し手[29996] 悪手 △４一玉  ▲４二金打  △同角  ▲同歩成
*#推奨手[2828]△４二歩打  ▲同歩成  △同角  ▲３三金打  △２一玉  ▲４二飛成  △５六角打  ▲２八玉  △３八金打  ▲１七玉  △２八銀打  ▲２六玉  △２四飛打  ▲３五玉
 117 ４二金打     ( 0:06/00:08:18)
*#指し手[29997]▲４二金打  △同角  ▲同歩成
 118 ４二角(33)   ( 0:01/00:00:59)
*#指し手[29998]△４二角  ▲同歩成
 119 ４二歩成(43) ( 0:02/00:08:20)
*#指し手[29999]▲４二歩成
*#先手 悪手:5回  疑問手:1回  好手:2回  定跡:5回  最善手:39回(65%)
*#後手 悪手:5回  疑問手:3回  好手:1回  定跡:5回  最善手:42回(71%)
*#先手 序盤力:88　中盤力:75　終盤力:41　全体:66
*#後手 序盤力:90　中盤力:60　終盤力:30　全体:57
*#棋譜解析 ぴよ将棋 v.5.0.9(Android) Lv.34 4コア ぴよベンチ:505
 120 投了         ( 0:01/00:01:00)
まで119手で先手の勝ち
        `}
);