export const sample1=`
#KIF version=2.0 encoding=UTF-8
# ---- Kifu for Windows V7 V7.06 棋譜ファイル ----
開始日時：2015/03/27 21:40:49
終了日時：2015/03/27 21:41:16
手合割：平手　　
後手の持駒：飛二　角二　金三　銀三　桂四　香三　歩十五　
  ９ ８ ７ ６ ５ ４ ３ ２ １
+---------------------------+
| ・ ・ ・ ・ ・ ・ ・ ・v香|一
| ・ ・ ・ ・ ・ ・ と ・v玉|二
| ・ ・ ・ ・ ・ ・ ・v歩 ・|三
| ・ ・ ・ ・ ・ ・ ・ ・v歩|四
| ・ ・ ・ ・ ・ ・ ・ ・ ・|五
| ・ ・ ・ ・ ・ ・ ・ ・ ・|六
| ・ ・ ・ ・ ・ ・ ・ ・ ・|七
| ・ ・ ・ ・ ・ ・ ・ ・ ・|八
| ・ ・ ・ ・ ・ ・ ・ ・ ・|九
+---------------------------+
先手の持駒：金　銀　
先手：攻め方
後手：受け方
手数----指手---------消費時間--
   1 ２二銀打     ( 0:05/00:00:05)
   2 ２一桂打     ( 0:06/00:00:06)
   3 １三金打     ( 0:03/00:00:08)
   4 同　桂(21)   ( 0:03/00:00:09)
   5 ２一銀(22)   ( 0:03/00:00:11)
   6 投了         ( 0:07/00:00:16)
まで5手で先手の勝ち
`
